app/controllers/room_books_controller.rb

INSERT INTO `room_books` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-10-18 15:17:46', '2017-10-18 15:17:46')
---
  def create
    @room_book = current_user.room_books.new(reservation_params)
    if @room_book.save