app/controllers/rooms_controller.rb

  def show
    @room = Room.find(params[:id])
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1

  def set_newroomdata_host
    @host = Host.where(user_id: current_user.id)
---
SELECT `hosts`.`id` FROM `hosts` WHERE `hosts`.`user_id` = '1'